; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=12, locations=13, max_capacity=2, out_folder=training/easy, instance_id=67, seed=108

(define (problem transport-67)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l2)
    (at p3 l5)
    (at p4 l4)
    (at p5 l3)
    (at p6 l4)
    (at p7 l12)
    (at p8 l6)
    (at p9 l4)
    (at p10 l2)
    (at p11 l4)
    (at p12 l2)
    (at v1 l9)
    (at v2 l7)
    (at v3 l2)
    (at v4 l9)
    (at v5 l6)
    (road l12 l1)
    (road l3 l10)
    (road l5 l13)
    (road l9 l5)
    (road l10 l3)
    (road l2 l5)
    (road l13 l5)
    (road l2 l8)
    (road l1 l12)
    (road l6 l2)
    (road l4 l2)
    (road l3 l6)
    (road l8 l2)
    (road l5 l9)
    (road l5 l12)
    (road l11 l7)
    (road l2 l4)
    (road l12 l5)
    (road l5 l2)
    (road l8 l7)
    (road l7 l11)
    (road l2 l6)
    (road l6 l3)
    (road l7 l8)
    (road l1 l9)
    (road l9 l1)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l4)
    (at p3 l3)
    (at p4 l11)
    (at p5 l9)
    (at p6 l1)
    (at p7 l2)
    (at p8 l9)
    (at p9 l11)
    (at p10 l13)
    (at p11 l9)
    (at p12 l6))))

; plan
1. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 0 of 12
2. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 0 of 12
3. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 0 of 12
4. (pick-up v1 l4 p1 c0 c1)
   deleted: (at p1 l4) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 12
5. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 0 of 12
6. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 0 of 12
7. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 0 of 12
8. (drop v1 l9 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l9) (capacity v1 c1)
   goals met: 1 of 12
9. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 1 of 12
10. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 1 of 12
11. (pick-up v1 l2 p2 c0 c1)
   deleted: (at p2 l2) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 12
12. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 1 of 12
13. (drop v1 l4 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l4) (capacity v1 c1)
   goals met: 2 of 12
14. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 2 of 12
15. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 2 of 12
16. (pick-up v1 l5 p3 c0 c1)
   deleted: (at p3 l5) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 12
17. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 2 of 12
18. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 2 of 12
19. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 2 of 12
20. (drop v1 l3 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l3) (capacity v1 c1)
   goals met: 3 of 12
21. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 3 of 12
22. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 3 of 12
23. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 3 of 12
24. (pick-up v1 l4 p4 c0 c1)
   deleted: (at p4 l4) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 12
25. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 3 of 12
26. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 3 of 12
27. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 3 of 12
28. (drive v1 l7 l11)
   deleted: (at v1 l7)
   added: (at v1 l11)
   goals met: 3 of 12
29. (drop v1 l11 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l11) (capacity v1 c1)
   goals met: 4 of 12
30. (drive v1 l11 l7)
   deleted: (at v1 l11)
   added: (at v1 l7)
   goals met: 4 of 12
31. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 4 of 12
32. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 4 of 12
33. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 4 of 12
34. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 4 of 12
35. (pick-up v1 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 12
36. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 4 of 12
37. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 4 of 12
38. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 4 of 12
39. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 4 of 12
40. (drop v1 l9 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l9) (capacity v1 c1)
   goals met: 5 of 12
41. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 5 of 12
42. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 5 of 12
43. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 5 of 12
44. (pick-up v1 l4 p6 c0 c1)
   deleted: (at p6 l4) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 12
45. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 5 of 12
46. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 5 of 12
47. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 5 of 12
48. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 5 of 12
49. (drop v1 l1 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l1) (capacity v1 c1)
   goals met: 6 of 12
50. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 6 of 12
51. (pick-up v1 l12 p7 c0 c1)
   deleted: (at p7 l12) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 12
52. (drive v1 l12 l5)
   deleted: (at v1 l12)
   added: (at v1 l5)
   goals met: 6 of 12
53. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 6 of 12
54. (drop v1 l2 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l2) (capacity v1 c1)
   goals met: 7 of 12
55. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 7 of 12
56. (pick-up v1 l6 p8 c0 c1)
   deleted: (at p8 l6) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 12
57. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 7 of 12
58. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 7 of 12
59. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 7 of 12
60. (drop v1 l9 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l9) (capacity v1 c1)
   goals met: 8 of 12
61. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 8 of 12
62. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 8 of 12
63. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 8 of 12
64. (pick-up v1 l4 p9 c0 c1)
   deleted: (at p9 l4) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 12
65. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 8 of 12
66. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 8 of 12
67. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 8 of 12
68. (drive v1 l7 l11)
   deleted: (at v1 l7)
   added: (at v1 l11)
   goals met: 8 of 12
69. (drop v1 l11 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l11) (capacity v1 c1)
   goals met: 9 of 12
70. (drive v1 l11 l7)
   deleted: (at v1 l11)
   added: (at v1 l7)
   goals met: 9 of 12
71. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 9 of 12
72. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 9 of 12
73. (pick-up v1 l2 p10 c0 c1)
   deleted: (at p10 l2) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 12
74. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 9 of 12
75. (drive v1 l5 l13)
   deleted: (at v1 l5)
   added: (at v1 l13)
   goals met: 9 of 12
76. (drop v1 l13 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l13) (capacity v1 c1)
   goals met: 10 of 12
77. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 10 of 12
78. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 10 of 12
79. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 10 of 12
80. (pick-up v1 l4 p11 c0 c1)
   deleted: (at p11 l4) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 12
81. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 10 of 12
82. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 10 of 12
83. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 10 of 12
84. (drop v1 l9 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l9) (capacity v1 c1)
   goals met: 11 of 12
85. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 11 of 12
86. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 11 of 12
87. (pick-up v1 l2 p12 c0 c1)
   deleted: (at p12 l2) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 12
88. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 11 of 12
89. (drop v1 l6 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l6) (capacity v1 c1)
   goals met: 12 of 12
